Aka Laundry/Aka Laundry/app/Controllers/Login.php

SELECT *
FROM `laundryku`
WHERE `username` = 'aqshal889'
 LIMIT 1
---
    public function action()
    {
        $session = session();
        $username = trim((string) $this->request->getPost('username'));
        $password = (string) $this->request->getPost('password');

        if ($username === '' || $password === '') {
            session()->setFlashdata('error', 'Username dan Password wajib diisi');
            return redirect()->to('/login/index');
        }

        $usercek = new LaundrykuModel();
        $cek = $usercek->where('username', $username)->first();