Aka Laundry/Aka Laundry/app/Models/TbReviewModel.php

    public function getLatestReviews(int $limit = 10): array
    {
        return $this->orderBy('tgl_review', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT *
FROM `tb_review`
ORDER BY `tgl_review` DESC
 LIMIT 10

    public function getAverageRating(): float
    {
        $result = $this->selectAvg('rating', 'avg_rating')->first();
---
SELECT AVG(`rating`) AS `avg_rating`
FROM `tb_review`
 LIMIT 1

    public function getTotalReviews(): int
    {
        return (int) $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_review`