app/Controllers/Pelanggan.php

SELECT *
FROM `tb_pelanggan`
---
    public function index()
    {
        $tb_pelanggan = new Tb_Pelanggan(); // memanggil model
        $all_data = $tb_pelanggan->findAll(); // mengambil semua data pelanggan