app/Controllers/PesananController.php

SELECT `tb_pesanan`.*, `tb_pelanggan`.`nama_pelanggan`, `tb_jenis`.`jenis_laundry`, `washer`.`name` AS `nama_washer`
FROM `tb_pesanan`
JOIN `tb_pelanggan` ON `tb_pelanggan`.`id_pelanggan` = `tb_pesanan`.`id_pelanggan`
JOIN `tb_jenis` ON `tb_jenis`.`kd_jenis` = `tb_pesanan`.`kd_jenis`
LEFT JOIN `laundryku` AS `washer` ON `washer`.`id` = `tb_pesanan`.`id_washer`
WHERE `tb_pesanan`.`status` IN ('Menunggu','Proses')
ORDER BY `tb_pesanan`.`id_pesanan` DESC
---
    public function washerView()
    {
        $model = new PesananModel();
        $data['pesanan'] = $model
            ->select('
                tb_pesanan.*,
                tb_pelanggan.nama_pelanggan,
                tb_jenis.jenis_laundry,
                washer.name AS nama_washer
            ')
            ->join('tb_pelanggan', 'tb_pelanggan.id_pelanggan = tb_pesanan.id_pelanggan')
            ->join('tb_jenis', 'tb_jenis.kd_jenis = tb_pesanan.kd_jenis')
            ->join('laundryku AS washer', 'washer.id = tb_pesanan.id_washer', 'left')
            ->whereIn('tb_pesanan.status', ['Menunggu', 'Proses'])
            ->orderBy('tb_pesanan.id_pesanan', 'DESC')
            ->findAll();