app/Models/Tb_Jenis.php

    public function getAllForPublic(): array
    {
        return $this->orderBy('tarif', 'ASC')->findAll() ?? [];
---
SELECT *
FROM `tb_jenis`
ORDER BY `tarif` ASC